var signal_hash = {
	"100" : "Подключение инициировано",
	"101" : "Открытие сокета",
	"102" : "Установка туннеля",
	"103" : "Авторизация",
	"104" : "Получение маршрутов",
	"200" : "Подключено",
	"400" : "Разрыв соединения по неустановленой причине",
	"401" : "Сервер недоступен",
	"402" : "Учетная запись истекла",
	"403" : "Ошибка авторизации (Логин/Пароль не верны)",
	"404" : "Сервер принудительно разорвал соединение"
}
var error_signals = ["400", "401", "402", "403", "404"]
var connecting_signals = ["100", "101", "102", "103", "104"]